In [70]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [71]:
df = pd.read_csv("50_Startups.csv")
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [72]:
df.isnull().sum()

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [73]:
df['State'].value_counts()

New York      17
California    17
Florida       16
Name: State, dtype: int64

In [74]:
dumm = pd.get_dummies(df['State'], drop_first = True)
dumm.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [75]:
df = pd.concat([dumm, df], axis=1)
df.head()

,Florida,New York,R&D Spend,Administration,Marketing Spend,State,Profit
0,0,1,165349.20,136897.80,471784.10,New York,192261.83
1,0,0,162597.70,151377.59,443898.53,California,191792.06
2,1,0,153441.51,101145.55,407934.54,Florida,191050.39
3,0,1,144372.41,118671.85,383199.62,New York,182901.99
4,1,0,142107.34,91391.77,366168.42,Florida,166187.94

In [76]:
df = df.drop(['State'], axis=1)
df.head()

   Florida  New York  R&D Spend  Administration  Marketing Spend     Profit
0        0         1  165349.20       136897.80        471784.10  192261.83
1        0         0  162597.70       151377.59        443898.53  191792.06
2        1         0  153441.51       101145.55        407934.54  191050.39
3        0         1  144372.41       118671.85        383199.62  182901.99
4        1         0  142107.34        91391.77        366168.42  166187.94

In [79]:
X = df.iloc[:,:-1].values
y = df.iloc[:,-1].values

In [86]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=0)

In [89]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [100]:
y_preds = model.predict(X_test)
y_test, y_preds

(array([103282.38, 144259.4 , 146121.95,  77798.83, 191050.39, 105008.31,
         81229.06,  97483.56, 110352.25, 166187.94,  96778.92,  96479.51,
        105733.54,  96712.8 , 124266.9 ]),
 array([104282.76472172, 132536.88499212, 133910.85007767,  72584.77489417,
        179920.9276189 , 114549.31079232,  66444.43261346,  98404.96840123,
        114499.82808601, 169367.50639895,  96522.62539981,  88040.6718287 ,
        110949.99405526,  90419.18978509, 128020.46250064]))

In [105]:
error = abs(y_test - y_preds).sum()
total = y_test.sum()
error, total, error/total

(97810.45774620361, 1742745.74, 0.0561243418940755)